# Code for gathering names of cities from H1B visa website

In [78]:
import requests
from bs4 import BeautifulSoup

In [79]:
link = 'https://h1bdata.info/topcities.php'

In [80]:
response = requests.get(link,timeout=1000)
content = BeautifulSoup(response.content,'lxml')
# get website from link

In [91]:
cities = []

for i in range(0,len(content.find_all('tr'))):
    try:
        cities.append([str(i.text) for i in content.find_all('tr')[:][i]][1])
        continue
    except:
        pass

In [92]:
import pandas
city = pandas.DataFrame()
city['Cities'] = cities[1:]
city.head()

          Cities
0       NEW YORK
1  SAN FRANCISCO
2        HOUSTON
3        CHICAGO
4        ATLANTA

In [93]:
city.tail()

         Cities
1995    BAYONNE
1996  PALISADES
1997     LEONIA
1998    DENISON
1999       FIFE

In [94]:
city.to_csv('cities.csv', sep = ',',index=False)